'''
Задания с 1 по 7

Задачи на линейный Алгоритм
'''


'''print ('')
print ("ЗАДАНИЕ №1","\n")
print ("Введите значение 'x'")
x = input ()
x = float(x)
y = 7 * x + 5
print ("y =", y,"\n")



print ("ЗАДАНИЕ №2","\n")
print ("Чтобы найти периметр квадрата, введите его сторону 'c' ")
c = input ()
c = float (c)
P = c * c
print ("Периметр =", P, "Сантиметра","\n")



print ("ЗАДАНИЕ №3","\n")
print ("Чтобы найти длину окружности, введите ее радиус 'r' ")
r = input ()
r = float (r)
p = 2 * 3.14 * r
print ("Длина окружности =", p, "Сантиметра","\n")



print ("ЗАДАНИЕ №4","\n")
print ("Чтобы найти длину окружности, введите ее диаметр 'D' ")
D = input ()
D = float (D)
dl = 3.14 * D
print ("Длина окружности =", p, "Сантиметра","\n")



print ("ЗАДАНИЕ №5","\n")
print ("Для нахождения гипотенузы прямоугольного треугольника, введите его катеты: k1 и k2",)
k1 = input ()
k1 = float (k1)
k2 = input ()
k2 = float (k2)
print ("k1 =", k1)
print ("k2 =", k2)
gP = (k1**2 - k2**2) ** 0.5
print ("Гиотенуза равна: ",gP,"\n")



print ("ЗАДАНИЕ №6","\n")
print ("Для нахождения периметра прямоугольного треугольника, введите его катеты: k1 и k2",)
k1 = input ()
k1 = float (k1)
k2 = input ()
k2 = float (k2)
gP = (k1**2 - k2**2) ** 0.5

PrT = gP + k1 + k2
print ("Периметр равен: ",PrT,"\n")



print ("ЗАДАНИЕ №7","\n")
print ("Для нахождения периметра и диагонали прямоугольника, введите его длину и ширину: D1 и S2",)

D1 = input ()
D1 = float (D1)
S1 = input ()
S1 = float (S1)
print ("Длина прямоугольника равна =", D1)
print ("Ширина прямоугольника равна =", S1)

Pr = D1 * S1
Dl = (D1**2 - S1**2) ** 0.5
print ("Периметр равен:", Pr,"\n")
print ("Диагональ равна:", Dl)'''



































